---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.OpeningWrapping
source: html/f13813ad-738a-9cd3-2fad-02aba0c0b5f9.htm
---
# Autodesk.Revit.DB.CompoundStructure.OpeningWrapping Property

Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings.

## Syntax (C#)
```csharp
public OpeningWrappingCondition OpeningWrapping { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration